Repository: marin-m/SongRec
Catalog: translations/locale/*/LC_MESSAGES/songrec.po
Languages: de_de, pl, ru

source: Exiting: audio device not found
de_de: Beenden: Audiogerät nicht gefunden
ru: Выход: аудиоустройство не найдено

source: Exiting: no audio devices found!
de_de: Beenden: Keine Audiogeräte gefunden!
ru: Выход: аудиоустройства не найдены!

source: Using device
de_de: Gerät verwenden
ru: Используется устройство

source: Error: Network unreachable
de_de: Fehler: Netzwerk nicht erreichbar
ru: Ошибка: Сеть недоступна

source: Warning: Network unreachable
de_de: Warnung: Netzwerk nicht erreichbar
ru: Предупреждение: сеть недоступна

source: No match for this song
de_de: Keine Übereinstimmung für dieses Lied
pl: Nie znaleziono piosenki
ru: Нет совпадений для этой песни

source: Error:
de_de: Fehler:
ru: Ошибка:

source: Recording started!
de_de: Aufnahme aktiv!
ru: Запись началась!

source: An open-source Shazam client for Linux, written in Rust.
de_de: Ein Open-Source Shazam Client für Linux, geschrieben in Rust.
pl: Otwarto-źródłowy klient Shazam dla Linuxa, stworzony w języku Rust.
ru: Клиент Shazam с открытым исходным кодом для Linux, написанный на Rust.

source: Run as a command-line program listening the microphone and printing recognized songs to stdout, exposing current song info via MPRIS
de_de: Wird als Kommandozeilenprogramm ausgeführt, das das Mikrofon abhört und erkannte Lieder per stdout ausgibt, wobei aktuelle Lied Informationen über MPRIS angezeigt werden
pl: Uruchom go w konsoli by wyszukiwał z mikrofonu rozpoznane piosenki do wyjścia standardowego, wyświetlając dane poprzez MPRIS
ru: Запускается в консоли, прослушивающая микрофон и выводящая распознанные песни в стандартный вывод, предоставляя текущую информацию о песне через MPRIS

source: Specify the audio device to use
de_de: Geben Sie das zu verwendende Audiogerät an
pl: Określ jakie urządzenie audio będzie używane
ru: Укажите аудиоустройство для использования

source: Enable printing full song info in JSON
de_de: Aktivieren der vollständigen Song Informationen Ausgabe im JSON Format
pl: Zezwól na zapis pełnych danych o piosence do formatu JSON
ru: Включить печать полной информации о песне в формате JSON

source: Enable printing full song info in the CSV format
de_de: Aktivieren der vollständigen Song Informationen Ausgabe im CSV Format
pl: Zezwól na zapis pełnych danych o piosence do formatu CSV
ru: Включить печать полной информации о песне в формате CSV

source: Disable MPRIS support
de_de: MPRIS Unterstützung deaktivieren
pl: Wyłącz wsparcie dla MPRIS
ru: Отключить поддержку MPRIS

source: Recognize one song from a sound file or microphone and print its info.
de_de: Erkennen Sie ein Lied aus einer Audio Datei oder von einem Mikrofon und geben Sie dessen Informationen aus.
pl: Rozpoznaj piosenkę z pliku lub mikrofonu i wyświetl dane o niej.
ru: Распознать одну песню из звукового файла или микрофона и вывести информацию о ней.

source: Recognize a file instead of using mic input
de_de: Erkennen aus einer Datei, anstelle des Mikrofon Eingang
pl: Skorzystaj z pliku zamiast używać danych z mikrofonu
ru: Распознавать файл вместо использования микрофонного ввода

source: Generate a Shazam fingerprint from a sound file, perform song recognition towards Shazam's servers and print obtained information to the standard output.
de_de: Erzeugen eines Shazam Fingerabdrucks aus einer Audio Datei, durchführen der Lied Erkennung mit Hilfe der Shazam Server und ausgeben der erhaltenen Informationen auf der Standardausgabe.
pl: Wygeneruj hash z pliku dźwiękowego i wysyłając go na serwery Shazam i wypisz uzyskane informacje na standardowe wyjście.
ru: Сгенерировать отпечаток Shazam из звукового файла, выполнить распознавание песни на серверах Shazam и вывести полученную информацию на стандартный вывод.

source: The audio file to recognize.
de_de: Die zu erkennende Audio Datei.
pl: Plik audio do rozpoznania.
ru: Аудиофайл для распознавания.

source: Recognize a currently playing song using the microphone and print obtained information to the standard output
de_de: Erkennen eines gerade wiedergegebenen Liedes über das Mikrofon und ausgeben der erhaltenen Informationen auf der Standardausgabe
pl: Rozpoznaj aktualnie odtwarzany utwór za pomocą mikrofonu i wypisz uzyskane informacje na standardowe wyjście
ru: Распознать воспроизводимую в данный момент песню с помощью микрофона и вывести полученную информацию на стандартный вывод

source: Generate a Shazam fingerprint from a sound file, and print it to the standard output.
de_de: Erzeugt einen Shazam Fingerabdruck aus einer Audio Datei und gibt ihn auf der Standardausgabe aus.
pl: Wygeneruj hash z pliku dźwiękowego i wypisz go do wyjścia standardowego.
ru: Сгенерировать отпечаток Shazam из звукового файла и вывести его на стандартный вывод.

source: The .WAV or .MP3 file to generate an audio fingerprint for.
de_de: Die .WAV oder .MP3 Datei, für die ein Audio-Fingerprint erstellt werden soll.
pl: Plik .WAV lub .MP3, dla którego ma zostać wygenerowany hash.
ru: Файл .WAV или .MP3, для которого необходимо создать аудиоотпечаток.

source: Take a data-URI Shazam fingerprint, perform song recognition towards Shazam's servers and print obtained information to the standard output.
de_de: Erstellen eines Daten-URI Shazam Fingerabdruck, durchführen der Lied Erkennung mit Hilfe der Shazam Server und ausgeben der erhaltenen Informationen auf der Standardausgabe.
pl: Wyciągnij data-URI z hashu i wykonaj rozpoznanie piosenki na serwerach Shazam a następnie wypisz uzyskane informacje do standardowego wyjścia.
ru: Взять отпечаток URI-данных Shazam, выполнить распознавание песни на серверах Shazam и вывести полученную информацию на стандартный вывод.

source: The data-URI Shazam fingerprint to recognize.
de_de: Der zu erkennende Daten-URI Shazam-Fingerabdruck.
pl: Hash data-URI do rozpoznania.
ru: Отпечаток данных URI Shazam для распознавания.

source: The default action. Display a GUI.
de_de: Die Standard Aktion. Eine grafische Benutzeroberfläche anzeigen.
pl: Domyślne działanie. Wyświetl graficzny interfejs użytkownika.
ru: Действие по умолчанию. Отображение графического интерфейса.

source: An optional audio file to recognize on the launch of the application.
de_de: Eine optionale Audiodatei, die beim Start der Anwendung erkannt wird.
pl: Opcjonalny plik dźwiękowy do rozpoznania przy uruchomieniu aplikacji.
ru: Дополнительный аудиофайл для распознавания при запуске приложения.

source: Launch the GUI, but don't recognize audio through the microphone as soon as it is launched (rather than expecting the user to click on a button).
de_de: Starten der grafische Benutzeroberfläche. Es wird aber kein Audio über das Mikrofon erkannt, sobald diese gestartet wurde (Anstatt zu erwarten, dass der Benutzer auf eine Schaltfläche klickt).
pl: Uruchom interfejs, ale nie rozpoznawaj dźwięku przez mikrofon zaraz po uruchomieniu (zamiast tego oczekuj na kliknięcie przez użytkownika przycisku).
ru: Запустить графический интерфейс, но не распознавать звук через микрофон сразу после запуска (ожидать, что пользователь нажмет кнопку).

source: Microphone error:
de_de: Mikrofon Fehler:
pl: Błąd mikrofonu:
ru: Ошибка микрофона:

source: Failed to get default input config
de_de: Standard Eingabe Konfiguration konnte nicht abgerufen werden
pl: Nie udało się uzyskać domyślnej konfiguracji urządzeń wejścia
ru: Не удалось получить конфигурацию ввода по умолчанию

source: Invalid sample rate in decoded Shazam packet
de_de: Ungültige Abtastrate im dekodierten Shazam Paket
pl: Nieprawidłowa częstotliwość próbkowania w zdekodowanym pakiecie Shazam
ru: Неверная частота дискретизации в декодированном пакете Shazam

source: Invalid frequency band in decoded Shazam packet
de_de: Ungültiges Frequenzband im dekodierten Shazam Paket
pl: Nieprawidłowe pasmo częstotliwości w zdekodowanym pakiecie Shazam
ru: Неверный диапазон частот в декодированном пакете Shazam

source: Invalid sample rate passed when encoding Shazam packet
de_de: Ungültige Abtastrate bei der Codierung des Shazam Pakets übergeben
pl: Nieprawidłowa częstotliwość próbkowania przekazana podczas kodowania pakietu Shazam
ru: При кодировании пакета Shazam передана неверная частота дискретизации

source: Unable to enable MPRIS support
de_de: MPRIS Unterstützung kann nicht aktiviert werden
ru: Невозможно включить поддержку MPRIS

source: Song recognized
de_de: Lied erkannt
pl: Utwór rozpoznany
ru: Песня распознана

source: When parsing the preferences file:
de_de: Beim Analysieren der Einstellungsdatei:
ru: При анализе файла настроек:

source: When saving the preferences file:
de_de: Beim Speichern der Einstellungsdatei:
ru: При сохранении файла настроек:

source: Error when reading the song history on the disk:
de_de: Fehler beim Lesen des Song Verlauf auf dem Datenträger:
ru: Ошибка при чтении истории песен на диске:

source: Error when reading the favorites on the disk:
de_de: Fehler beim Lesen der Favoriten auf dem Datenträger:
ru: Ошибка при чтении избранного на диске:

source: Recognize songs
de_de: Lieder erkennen
pl: Rozpoznaj utwory muzyczne
ru: Распознавать песни

source: Recognize from file
de_de: Erkennung aus Datei
pl: Rozpoznaj z pliku
ru: Распознать из файла

source: Shazam servers are not reachable, are you connected?
de_de: Die Shazam Server sind nicht erreichbar, sind Sie verbunden?
pl: Serwery Shazam nie są osiągalne, czy jesteś połączony do internetu?
ru: Серверы Shazam недоступны, Вы подключены к Интернету?

source: Recognition results
de_de: Erkennungs Ergebnisse
pl: Wyniki sprawdzania
ru: Результаты распознавания

source: Search on YouTube
de_de: Suche auf Youtube
pl: Wyszukaj na YouTube
ru: Поиск на YouTube

source: Audio input
de_de: Audio Eingang
pl: Wejście audio
ru: Аудиовход

source: Recognition history
de_de: Erkennungs Verlauf
pl: Historia rozpoznawania
ru: История распознавания

source: Song name
de_de: Lied Name
pl: Nazwa piosenki
ru: Название песни

source: Album
ru: Альбом

source: Recognition date
de_de: Erkennungs Datum
pl: Data rozpoznania
ru: Дата распознавания

source: Export to CSV
de_de: Nach CSV exportieren
pl: Wyeksportuj do CSV
ru: Экспорт в CSV

source: Favorites
ru: Избранное

source: About...
ru: О...

source: Select a file to recognize
de_de: Wählen Sie eine zu erkennende Datei
pl: Wybierz plik do rozpoznania
ru: Выберите файл для распознавания

source: Copy artist and track
de_de: Künstler und Titelname kopieren
pl: Skopiuj wykonawcę i utwór
ru: Копировать исполнителя и трек

source: Copy artist
de_de: Künstler kopieren
pl: Skopiuj wykonawcę
ru: Копировать исполнителя

source: Copy track name
de_de: Titelname kopieren
pl: Skopiuj nazwę utworu
ru: Копировать название трека

source: Copy album
de_de: Album kopieren
pl: Skopiuj nazwę albumu
ru: Копировать альбом

source: Add to Favorites
ru: Добавить в Избранное

source: Remove from Favorites
de_de: Von Favoriten entfernen
ru: Удалить из Избранного

source: Application::new failed
pl: Nie udało się uruchomić funkcji Application::new

source: Turn on speakers recognition
pl: Włącz rozpoznawania z mikrofonu

source: Turn off speakers recognition
pl: Wyłącz rozpoznawania z mikrofonu

source: Turn on microphone recognition
pl: Włącz rozpoznawania z mikrofonu

source: Turn off microphone recognition
pl: Wyłącz rozpoznawania z mikrofonu

source: _Open
pl: _Otwórz

source: _Cancel
pl: _Wyjdź

source: Couldn't get filename
pl: Nie można uzyskać nazwy pliku

source: Recognize from my speakers instead of microphone
pl: Rozpoznaj z głośników zamiast mikrofonu

source: Current volume:
pl: Aktualna głośność:

source: Wipe history
pl: Wyczyść historię
